#*********************************
#    Name:     林辰昊            *
#    Class:    資管系            *
#    SID:      S05490059         *
#    Function: 資料加解密練習    *
#    Homework: NO.1              *
#    Date:     2018/10/16        *
#*********************************




print("""**********************************
*   資料加密與解密的應用程式     *
*   資管系 林辰昊 S05490059      *
**********************************\n\n""")
import time
#################加密过程#################

start=time.time()                                     #開始計時
ii=int(input('Please input the number(0000-9999):'))  #輸入待加密的數字
jj=int(input('Please input the key(1-9):'))           #輸入KEY值
#----------------------------------------------       #將待加密數字切割為四個位數
m1=ii%10
ii=ii/10
m2=ii%10
ii=ii/10
m3=ii%10
ii=ii/10
m4=ii%10
#----------------------------------------------       #將這四個位數分別作加密處理
m1=int((m1+jj)%10)
m2=int((m2+jj)%10)
m3=int((m3+jj)%10)
m4=int((m4+jj)%10)
result1=m1*1000+m2*100+m3*10+m4
result1="%04d"%result1                                #保留四位數中的第一位零
#----------------------------------------------
print('The result after encrypt:',result1)            #印出加密結果


################解密过程##################

xx=int(input('Please input the Encrypted Data:'))     #輸入已加密資料
#----------------------------------------------       #將已加密數字分割為四個位數
n1=xx%10
xx=xx/10
n2=xx%10
xx=xx/10
n3=xx%10
xx=xx/10
n4=xx%10
#----------------------------------------------       #將這四個位數分別作解密處理，使用int是為了保留整數
jj=10-jj
n1=int((n1+jj)%10)
n2=int((n2+jj)%10)
n3=int((n3+jj)%10)
n4=int((n4+jj)%10)
result2=n4+n3*10+n2*100+n1*1000
result2="%04d"%result2                                #保留四位數中的第一位零
#----------------------------------------------
print('The Original Data is:',result2)                #印出解密結果
end=time.time()                                       #計時結束


################时间计算##################
print("Total Running Time(include input time):",end-start,"S")  #印出整個程序所用時間（包括輸入資料所用時間）










